odip.opendatasupport.eu/value_mapping/gr.org
#+TITLE: ODS Greece Harmonization Rules
#+OPTIONS: toc:2          (only to two levels in TOC)
#+TODO: TODO(t) WAIT(w@/!) | STARTED(s) | DONE(d!) CANCELED(c@)
#+DRAWERS: HIDDEN PROPERTIES STATE

* Introduction

   - http://192.168.33.33/lodms
   - http://192.168.33.33/sparql

This file contains:
   - (1) :: Selects which connect to the SPARQL endpoint above (C-c C-c)
   - (2) :: The inserts which are tangled (C-c C-v t) into a single file.

** Accessible Predicate 

To get the predicates accessible:

#+NAME: sparqlend_direct_predicates
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gov.gr/>
PREFIX dct: <http://purl.org/dc/terms/>
SELECT DISTINCT ?p
FROM <http://data.gov.gr/>
where {
 ?ds a dcat:Dataset .
 ?ds ?p ?o
} ORDER BY ?p
#+end_src

#+RESULTS: sparqlend_direct_predicates
| p                                               |
| http://purl.org/dc/terms/accrualPeriodicity     |
| http://purl.org/dc/terms/description            |
| http://purl.org/dc/terms/identifier             |
| http://purl.org/dc/terms/issued                 |
| http://purl.org/dc/terms/language               |
| http://purl.org/dc/terms/modified               |
| http://purl.org/dc/terms/publisher              |
| http://purl.org/dc/terms/spatial                |
| http://purl.org/dc/terms/title                  |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| http://www.w3.org/ns/adms#contactPoint          |
| http://www.w3.org/ns/dcat#distribution          |
| http://www.w3.org/ns/dcat#keyword               |
| http://www.w3.org/ns/dcat#landingPage           |
| http://www.w3.org/ns/dcat#theme                 |

** Count of Datasets

#+NAME: sparqlend_count
#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gov.gr/> 
SELECT DISTINCT ?dc ( COUNT(?ds) AS ?cnt )
FROM <http://data.gov.gr/> 
WHERE {
 ?dc a dcat:Catalog .
 ?dc dcat:dataset ?ds .
} ORDER BY ?dc
#+end_src

#+RESULTS: sparqlend_count
| dc                     | cnt |
| http://www.data.gov.gr |   1 |

** Distribution predicates 

#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gov.gr/> 
SELECT DISTINCT ?p
FROM <http://data.gov.gr/> 
WHERE {
 ?dc a dcat:Distribution .
 ?dc ?p ?o .
}
#+end_src

#+RESULTS:
| p                                               |
| http://www.w3.org/1999/02/22-rdf-syntax-ns#type |
| http://purl.org/dc/terms/description            |
| http://purl.org/dc/terms/format                 |
| http://www.w3.org/ns/dcat#accessURL             |
| http://purl.org/dc/terms/license                |
| http://purl.org/dc/terms/title                  |
| http://www.w3.org/ns/dcat#downloadURL           |
| http://www.w3.org/ns/dcat#mediaType             |
| http://www.w3.org/ns/adms#status                |
| http://www.w3.org/ns/dcat#byteSize              |

** Title/Description Sizes

#+NAME: sparqlend_size
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT ?size ?title ?description
FROM <http://data.gov.gr/> 
WHERE { 
  { select ( SUM(?len) AS ?size ) 
           { ?s ?p ?o .
             FILTER isLiteral(?o) 
             BIND(STRLEN(STR(?o)) AS ?len) }
  }
  { select ( SUM(?tlen) AS ?title ) 
           { ?s dct:title ?o .
             FILTER isLiteral(?o) 
             BIND(STRLEN(STR(?o)) AS ?tlen) }
  }
  { select ( SUM(?dlen) AS ?description ) 
           { ?s dct:description ?o .
             FILTER isLiteral(?o) 
             BIND(STRLEN(STR(?o)) AS ?dlen) }
  } 
}
#+end_src

#+RESULTS: sparqlend_size
| size | title | description |
|  785 |   136 |         456 |

** List of key/value pairs 

#+NAME: sparqlend_key_value
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gov.gr/> 
SELECT DISTINCT ?keyword
FROM <http://data.gov.gr/> 
WHERE {
  ?ds a dcat:Dataset .
  ?ds dcat:keyword ?keyword . 
} ORDER BY ?keyword LIMIT 100
#+end_src

#+RESULTS: sparqlend_key_value
| keyword  |
| Economic |
| Prices   |

