odip.opendatasupport.eu/mapping_queries/gr.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>ODS Greece Harmonization Rules</title>
<!-- 2013-12-19 Thu 16:25 -->
<meta  http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta  name="generator" content="Org-mode" />
<meta  name="author" content="Paul Massey" />
</head>
<body>
<div id="content">
<h1 class="title">ODS Greece Harmonization Rules</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">Introduction</a>
<ul>
<li><a href="#sec-1-1">Accessible Predicate</a></li>
<li><a href="#sec-1-2">Count of Datasets</a></li>
<li><a href="#sec-1-3">Distribution predicates</a></li>
<li><a href="#sec-1-4">Title/Description Sizes</a></li>
<li><a href="#sec-1-5">List of key/value pairs</a></li>
<li><a href="#sec-1-6">List of themes</a></li>
<li><a href="#sec-1-7">List of formats</a></li>
<li><a href="#sec-1-8">List of concepts</a></li>
</ul>
</li>
<li><a href="#sec-2">Recommended</a>
<ul>
<li><a href="#sec-2-1">distribution title</a></li>
<li><a href="#sec-2-2">distribution description</a></li>
<li><a href="#sec-2-3">distribution format</a></li>
<li><a href="#sec-2-4">distribution accessURL</a></li>
<li><a href="#sec-2-5">distribution license</a></li>
</ul>
</li>
<li><a href="#sec-3">Optional</a>
<ul>
<li><a href="#sec-3-1">byte size</a></li>
<li><a href="#sec-3-2">download URL</a></li>
<li><a href="#sec-3-3">media type</a></li>
<li><a href="#sec-3-4">release date</a></li>
<li><a href="#sec-3-5">modification date</a></li>
<li><a href="#sec-3-6">rights</a></li>
<li><a href="#sec-3-7">status</a></li>
<li><a href="#sec-3-8">title</a></li>
</ul>
</li>
<li><a href="#sec-4">Dataset properties</a>
<ul>
<li><a href="#sec-4-1">Mandatory</a></li>
<li><a href="#sec-4-2">Recommended</a></li>
<li><a href="#sec-4-3">Optional</a></li>
</ul>
</li>
<li><a href="#sec-5">Value Mapping</a></li>
<li><a href="#sec-6">ODS Greece Harmonization Tasks</a>
<ul>
<li><a href="#sec-6-1">LodManager Initialisation <code>[2/3]</code></a></li>
<li><a href="#sec-6-2">Tests</a></li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Introduction</h2>
<div class="outline-text-2" id="text-1">
<ul class="org-ul">
<li><a href="http://192.168.33.33/lodms">http://192.168.33.33/lodms</a>
</li>
<li><a href="http://192.168.33.33/sparql">http://192.168.33.33/sparql</a>
</li>
</ul>

<p>
This file contains:
</p>
<dl class="org-dl">
<dt> (1) </dt><dd>Selects which connect to the SPARQL endpoint above (C-c C-c)
</dd>
<dt> (2) </dt><dd>The inserts which are tangled (C-c C-v t) into a single file.
</dd>
</dl>
</div>

<div id="outline-container-sec-1-1" class="outline-3">
<h3 id="sec-1-1"><span class="section-number-3">1.1</span> Accessible Predicate</h3>
<div class="outline-text-3" id="text-1-1">
<p>
To get the predicates accessible:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_direct_predicates">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gov.gr/&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt;
SELECT DISTINCT ?p
FROM &lt;http://data.gov.gr/&gt;
where {
 ?ds a dcat:Dataset .
 ?ds ?p ?o
} ORDER BY ?p
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">p</td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/accrualPeriodicity">http://purl.org/dc/terms/accrualPeriodicity</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/description">http://purl.org/dc/terms/description</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/identifier">http://purl.org/dc/terms/identifier</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/issued">http://purl.org/dc/terms/issued</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/language">http://purl.org/dc/terms/language</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/modified">http://purl.org/dc/terms/modified</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/publisher">http://purl.org/dc/terms/publisher</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/spatial">http://purl.org/dc/terms/spatial</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/title">http://purl.org/dc/terms/title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/1999/02/22-rdf-syntax-ns#type">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/adms#contactPoint">http://www.w3.org/ns/adms#contactPoint</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#distribution">http://www.w3.org/ns/dcat#distribution</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#keyword">http://www.w3.org/ns/dcat#keyword</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#landingPage">http://www.w3.org/ns/dcat#landingPage</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#theme">http://www.w3.org/ns/dcat#theme</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-2" class="outline-3">
<h3 id="sec-1-2"><span class="section-number-3">1.2</span> Count of Datasets</h3>
<div class="outline-text-3" id="text-1-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_count">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gov.gr/&gt; 
SELECT DISTINCT ?dc ( COUNT(?ds) AS ?cnt )
FROM &lt;http://data.gov.gr/&gt; 
WHERE {
 ?dc a dcat:Catalog .
 ?dc dcat:dataset ?ds .
} ORDER BY ?dc
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">dc</td>
<td class="right">cnt</td>
</tr>

<tr>
<td class="left"><a href="http://www.data.gov.gr">http://www.data.gov.gr</a></td>
<td class="right">1</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-3" class="outline-3">
<h3 id="sec-1-3"><span class="section-number-3">1.3</span> Distribution predicates</h3>
<div class="outline-text-3" id="text-1-3">
<div class="org-src-container">

<pre class="src src-roqet">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gov.gr/&gt; 
SELECT DISTINCT ?p
FROM &lt;http://data.gov.gr/&gt; 
WHERE {
 ?dc a dcat:Distribution .
 ?dc ?p ?o .
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">p</td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/1999/02/22-rdf-syntax-ns#type">http://www.w3.org/1999/02/22-rdf-syntax-ns#type</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/description">http://purl.org/dc/terms/description</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/format">http://purl.org/dc/terms/format</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#accessURL">http://www.w3.org/ns/dcat#accessURL</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/license">http://purl.org/dc/terms/license</a></td>
</tr>

<tr>
<td class="left"><a href="http://purl.org/dc/terms/title">http://purl.org/dc/terms/title</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#downloadURL">http://www.w3.org/ns/dcat#downloadURL</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#mediaType">http://www.w3.org/ns/dcat#mediaType</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/adms#status">http://www.w3.org/ns/adms#status</a></td>
</tr>

<tr>
<td class="left"><a href="http://www.w3.org/ns/dcat#byteSize">http://www.w3.org/ns/dcat#byteSize</a></td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-4" class="outline-3">
<h3 id="sec-1-4"><span class="section-number-3">1.4</span> Title/Description Sizes</h3>
<div class="outline-text-3" id="text-1-4">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_size">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT ?size ?title ?description
FROM &lt;http://data.gov.gr/&gt; 
WHERE { 
  { select ( SUM(?len) AS ?size ) 
	   { ?s ?p ?o .
	     FILTER isLiteral(?o) 
	     BIND(STRLEN(STR(?o)) AS ?len) }
  }
  { select ( SUM(?tlen) AS ?title ) 
	   { ?s dct:title ?o .
	     FILTER isLiteral(?o) 
	     BIND(STRLEN(STR(?o)) AS ?tlen) }
  }
  { select ( SUM(?dlen) AS ?description ) 
	   { ?s dct:description ?o .
	     FILTER isLiteral(?o) 
	     BIND(STRLEN(STR(?o)) AS ?dlen) }
  } 
}
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="right" />

<col  class="right" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="right">size</td>
<td class="right">title</td>
<td class="right">description</td>
</tr>

<tr>
<td class="right">785</td>
<td class="right">136</td>
<td class="right">456</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-5" class="outline-3">
<h3 id="sec-1-5"><span class="section-number-3">1.5</span> List of key/value pairs</h3>
<div class="outline-text-3" id="text-1-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_key_value">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gov.gr/&gt; 
SELECT DISTINCT ?keyword
FROM &lt;http://data.gov.gr/&gt; 
WHERE {
  ?ds a dcat:Dataset .
  ?ds dcat:keyword ?keyword . 
} ORDER BY ?keyword LIMIT 100
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">keyword</td>
</tr>

<tr>
<td class="left">Economic</td>
</tr>

<tr>
<td class="left">Prices</td>
</tr>
</tbody>
</table>
</div>
</div>
