odip.opendatasupport.eu/value_mapping/gr.org
** List of themes

#+NAME: sparqlend_theme
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gov.gr/> 
SELECT DISTINCT ?theme
FROM <http://data.gov.gr/> 
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
  ?ds dcat:theme ?theme . 
} ORDER BY ?theme LIMIT 100
#+end_src

#+RESULTS: sparqlend_theme
| theme |
| EC    |
| PR    |

** List of formats

#+NAME: sparqlend_format
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX orig: <http://data.gov.gr/>
SELECT DISTINCT ?format
FROM <http://data.gov.gr/>
WHERE {
  ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
  ?ds dct:format ?format . 
} ORDER BY ?format LIMIT 100
#+end_src

** List of concepts

The list of acceptable file types can be accessed at:
     http://publications.europa.eu/resource/authority/file-type

#+NAME: sparqlend_select_concept
#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
select distinct ?concept
FROM <http://publications.europa.eu/resource/authority/file-type>
WHERE {
  ?concept a <http://www.w3.org/2004/02/skos/core#Concept>
} ORDER BY ?concept
#+end_src

#+RESULTS: sparqlend_select_concept
: concept

* Recommended
** distribution title

#+NAME: sparqlend_disttitle
#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gov.gr/catalog/predicate/> 
SELECT DISTINCT ?disttitle 
FROM <http://data.gov.gr/>
WHERE {
 ?dist a dcat:Distribution .
 ?dist dct:title ?disttitle . 
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_disttitle
| disttitle |         |   |             |      |
| ????????? | ??????? | - | ??????????  | 2013 |
| ????????? | ??????? | - | ??????????? | 2013 |

The INSERT statement is:

#+NAME: sparqlend_disttitle_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?distribution .
 ?distribution a dcat:Distribution .
 ?distribution dct:title ?title .
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds dcat:distribution ?dist.
 ?dist a dcat:Distribution .
 ?dist dct:title ?title .
 BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
 BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution).
}
#+END_SRC

#+RESULTS: sparqlend_disttitle_insert

** distribution description

#+NAME: sparqlend_distdescription
#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?dist ?distdesc
WHERE {
 ?ds dcat:distribution ?dist
 ?dist a dcat:Distribution . 
 ?dist dct:description ?distdesc .
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_distdescription
| dist                                               | distdesc                                                        |
| XXX/distributions/bcc860c10f0861ddbd4ef3aefbc21ac0 | ’ meetings with external organisations, May - July 2010         |
| XXX/distributions/cb03484512a3484ea9dd26f76f3ed494 | ’ meetings with external organisations, August - September 2010 |
| XXX/distributions/1d7d6cf1418ec4724ba6b5138a713535 | 2010 November Return                                            |
| XXX/distributions/6f7707c04f21d7667ff96fdf09ce9919 | Senior staff post and pay, as of 31/03/2011                     |
| XXX/distributions/9d1adbe53149e2cdaaf46b05c19e082c | Junior staff numbers and pay scales, as of 31/03/2011           |
| XXX/distributions/3de049a500d1bf8646624b8bc6810ff5 | Junior and Senior organogram data in RDF, as of 31/03/2011      |
| XXX/distributions/8d0dd5f33b9799859c5a4e344256cb1d | £25k from Nottingham City PCT                                   |
| XXX/distributions/4e6bf901da418f018c85ca9283e58561 | Financial Year 2007-08 Provisional                              |
| XXX/distributions/31fb280b4a387659464ea78aac9f056e | Financial Year 2008-09 (Provisional)                            |
| XXX/distributions/1a5136648bc81a62975ba9506b6cb9b5 | Financial Year 2009-10 (Provisional)                            |

The INSERT statement is:

#+NAME: sparqlend_distdescription_insert
#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:description ?description .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds dcat:distribution ?dist . 
  ?dist a dcat:Distribution .
  ?dist dct:description ?description .
  BIND(concat(str(?harmds), "/distributions/") AS ?hds)
  BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

#+RESULTS: sparqlend_distdescription_insert

** distribution format

#+NAME: sparqlend_format
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?distribution ?format
WHERE {
 ?ds dcat:distribution ?dist.    
 ?dist a dcat:Distribution .
 ?dist dct:format ?format .
 BIND(CONCAT(STR("XXXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
} LIMIT 10
#+end_src

#+RESULTS: sparqlend_format
| distribution                                        | format                 |
| XXXX/distributions/1d0a888a29c2cf03fec0925d076d14e2 | http://example.org/me# |
| XXXX/distributions/2c571faba56e1a7d99338adf5b5d1985 | http://example.org/me# |
| XXXX/distributions/881c4b284785883f7104a561586fbd95 | http://example.org/me# |
| XXXX/distributions/6766d823595b457039f8122964b13d19 | http://example.org/me# |
| XXXX/distributions/ae6687537acfb3a9842f5953024335de | http://example.org/me# |
| XXXX/distributions/af8dc2eaeda02d9085fd68ba2399899b | http://example.org/me# |
| XXXX/distributions/998418cf78e64ae9511cae65bb59fd37 | http://example.org/me# |
| XXXX/distributions/d6b636c06ffbe022c72281fad1a23419 | http://example.org/me# |
| XXXX/distributions/4d7f71ad5cb8aa118fd90d592bec81b0 | http://example.org/me# |
| XXXX/distributions/d2cf3c52c5efb65443f75418c1e6286e | http://example.org/me# |

The INSERT statement is:

#+NAME: sparqlend_format_insert
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
PREFIX  orig: <http://data.gov.gr/catalog/predicate/>
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:format ?format .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds dcat:distribution ?dist.
  ?dist a dcat:Distribution .
  ?dist dct:format ?format .
  BIND(concat(str(?harmds), "/distributions/") AS ?hds)
  BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

#+RESULTS: sparqlend_format_insert

*** TODO mapping of the values (to a URI)
    
