odip.opendatasupport.eu/mapping_queries/gr.html
<div id="outline-container-sec-1-6" class="outline-3">
<h3 id="sec-1-6"><span class="section-number-3">1.6</span> List of themes</h3>
<div class="outline-text-3" id="text-1-6">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_theme">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gov.gr/&gt; 
SELECT DISTINCT ?theme
FROM &lt;http://data.gov.gr/&gt; 
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
  ?ds dcat:theme ?theme . 
} ORDER BY ?theme LIMIT 100
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">theme</td>
</tr>

<tr>
<td class="left">EC</td>
</tr>

<tr>
<td class="left">PR</td>
</tr>
</tbody>
</table>
</div>
</div>
<div id="outline-container-sec-1-7" class="outline-3">
<h3 id="sec-1-7"><span class="section-number-3">1.7</span> List of formats</h3>
<div class="outline-text-3" id="text-1-7">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_format">PREFIX dct: &lt;http://purl.org/dc/terms/&gt;
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX orig: &lt;http://data.gov.gr/&gt;
SELECT DISTINCT ?format
FROM &lt;http://data.gov.gr/&gt;
WHERE {
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . 
  ?ds dct:format ?format . 
} ORDER BY ?format LIMIT 100
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-1-8" class="outline-3">
<h3 id="sec-1-8"><span class="section-number-3">1.8</span> List of concepts</h3>
<div class="outline-text-3" id="text-1-8">
<p>
The list of acceptable file types can be accessed at:
     <a href="http://publications.europa.eu/resource/authority/file-type">http://publications.europa.eu/resource/authority/file-type</a>
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_concept">select distinct ?concept
FROM &lt;http://publications.europa.eu/resource/authority/file-type&gt;
WHERE {
  ?concept a &lt;http://www.w3.org/2004/02/skos/core#Concept&gt;
} ORDER BY ?concept
</pre>
</div>

<pre class="example">
concept
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Recommended</h2>
<div class="outline-text-2" id="text-2">
</div><div id="outline-container-sec-2-1" class="outline-3">
<h3 id="sec-2-1"><span class="section-number-3">2.1</span> distribution title</h3>
<div class="outline-text-3" id="text-2-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_disttitle">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gov.gr/catalog/predicate/&gt; 
SELECT DISTINCT ?disttitle 
FROM &lt;http://data.gov.gr/&gt;
WHERE {
 ?dist a dcat:Distribution .
 ?dist dct:title ?disttitle . 
} LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">disttitle</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="left">&#xa0;</td>
<td class="right">&#xa0;</td>
</tr>

<tr>
<td class="left">?????????</td>
<td class="left">???????</td>
<td class="left">-</td>
<td class="left">??????????</td>
<td class="right">2013</td>
</tr>

<tr>
<td class="left">?????????</td>
<td class="left">???????</td>
<td class="left">-</td>
<td class="left">???????????</td>
<td class="right">2013</td>
</tr>
</tbody>
</table>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_disttitle_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?distribution .
 ?distribution a dcat:Distribution .
 ?distribution dct:title ?title .
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds dcat:distribution ?dist.
 ?dist a dcat:Distribution .
 ?dist dct:title ?title .
 BIND (CONCAT(?harmds,"/distributions/") AS ?hds)
 BIND (IRI(CONCAT(?hds,md5(?dist))) AS ?distribution).
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-2" class="outline-3">
<h3 id="sec-2-2"><span class="section-number-3">2.2</span> distribution description</h3>
<div class="outline-text-3" id="text-2-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_distdescription">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?dist ?distdesc
WHERE {
 ?ds dcat:distribution ?dist
 ?dist a dcat:Distribution . 
 ?dist dct:description ?distdesc .
 BIND(CONCAT(STR("XXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_distdescription_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:description ?description .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds dcat:distribution ?dist . 
  ?dist a dcat:Distribution .
  ?dist dct:description ?description .
  BIND(concat(str(?harmds), "/distributions/") AS ?hds)
  BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-2-3" class="outline-3">
<h3 id="sec-2-3"><span class="section-number-3">2.3</span> distribution format</h3>
<div class="outline-text-3" id="text-2-3">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_format">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?distribution ?format
WHERE {
 ?ds dcat:distribution ?dist.    
 ?dist a dcat:Distribution .
 ?dist dct:format ?format .
 BIND(CONCAT(STR("XXXX"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_format_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
PREFIX  orig: &lt;http://data.gov.gr/catalog/predicate/&gt;
INSERT {
  ?harmds dcat:distribution ?distribution .
  ?distribution a dcat:Distribution .
  ?distribution dct:format ?format .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds dcat:distribution ?dist.
  ?dist a dcat:Distribution .
  ?dist dct:format ?format .
  BIND(concat(str(?harmds), "/distributions/") AS ?hds)
  BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>

<div id="outline-container-sec-2-3-1" class="outline-4">
<h4 id="sec-2-3-1"><span class="section-number-4">2.3.1</span> <span class="todo TODO">TODO</span> mapping of the values (to a URI)</h4>
</div>
</div>
