odip.opendatasupport.eu/value_mapping/gr.org
** distribution accessURL

#+NAME: sparqlend_accessURL
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gov.gr/predicate/> 
SELECT DISTINCT ?distribution ?accessUrl
WHERE { GRAPH <http://data.gov.gr/> {
 ?ds a dcat:Distribution .
 ?ds dcat:accessURL ?accessUrl .
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_accessURL
| distribution                                   | accessUrl                                                                                                                                      |
| /distribution/0793cde5cf7c69f8a20bcc54c1375393 | https://datagovgreece.s3.amazonaws.com/resources/dataset_6/01%20%CE%99%CE%B1%CE%BD%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx       |
| /distribution/bfe4f55f152f7e5e457e0c61a32369e8 | https://datagovgreece.s3.amazonaws.com/resources/dataset_6/02%20%CE%A6%CE%B5%CE%B2%CF%81%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx |

The INSERT statement is:

#+NAME: sparqlend_accessURL_insert
#+begin_src rq :tangle yes
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:accessURL ?accessUrl .
} WHERE {
    ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
    ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
    ?ds dcat:distribution ?dist.    
    ?dist a dcat:Distribution .
    ?dist dcat:accessURL ?accessUrl .
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

*** TODO Check construction of ?distribution uri is okay.

#+RESULTS: sparqlend_accessURL_insert

** distribution license

#+NAME: sparqlend_license
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gov.gr/predicate/> 
SELECT DISTINCT ?distribution ?license
WHERE { GRAPH <http://data.gov.gr/> {
 ?ds a dcat:Dataset .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution . 
 ?dist dct:license ?license . 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_license
| distribution                                        | license                                        |
| true/distributions/0793cde5cf7c69f8a20bcc54c1375393 | http://creativecommons.org/licenses/by-sa/3.0/ |
| true/distributions/bfe4f55f152f7e5e457e0c61a32369e8 | http://creativecommons.org/licenses/by-sa/3.0/ |

The INSERT for the license is:

#+NAME: sparqlend_format
#+begin_src :tangle yes
PREFIX orig: <http://data.gov.gr/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?distribution.
 ?distribution a dcat:Distribution.
 ?distribution dct:license ?license.
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds a dcat:Dataset .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution . 
 ?dist dct:license ?license . 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
#+end_src

* Optional
** byte size

#+NAME: sparqlend_bytesize
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT DISTINCT ?distribution ?byteSize
WHERE { GRAPH <http://data.gov.gr/> {
 ?ds a dcat:Distribution .
 ?ds dcat:byteSize ?byteSize .
 FILTER( datatype(?byteSize) = xsd:decimal )
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_bytesize
| distribution                                   | byteSize |
| /distribution/0793cde5cf7c69f8a20bcc54c1375393 | 11114906 |
| /distribution/bfe4f55f152f7e5e457e0c61a32369e8 | 10590618 |

*** TODO byteSize is xsd:integer but spec says xsd:decimal
  - Note :: The filter is *not* included in the lodms query at
            present - there would not be any results.

The INSERT statement is:

#+NAME: sparqlend_byteSize_insert
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  dcat: <http://www.w3.org/ns/dcat#>
PREFIX  dct:  <http://purl.org/dc/terms/>
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:byteSize ?byteSize .
} WHERE {
    ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds .
    ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
    ?ds dcat:distribution ?dist .
    ?dist a dcat:Distribution .
    ?dist dcat:byteSize ?byteSize .
    FILTER( datatype(?byteSize) = xsd:decimal )
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
#+end_src

** download URL

url points to a PDF

** media type

type indicates "dataset"

