odip.opendatasupport.eu/mapping_queries/gr.html
<div id="outline-container-sec-2-4" class="outline-3">
<h3 id="sec-2-4"><span class="section-number-3">2.4</span> distribution accessURL</h3>
<div class="outline-text-3" id="text-2-4">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_accessURL">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gov.gr/predicate/&gt; 
SELECT DISTINCT ?distribution ?accessUrl
WHERE { GRAPH &lt;http://data.gov.gr/&gt; {
 ?ds a dcat:Distribution .
 ?ds dcat:accessURL ?accessUrl .
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">distribution</td>
<td class="left">accessUrl</td>
</tr>

<tr>
<td class="left">/distribution/0793cde5cf7c69f8a20bcc54c1375393</td>
<td class="left"><a href="https://datagovgreece.s3.amazonaws.com/resources/dataset_6/01%20%CE%99%CE%B1%CE%BD%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx">https://datagovgreece.s3.amazonaws.com/resources/dataset_6/01%20%CE%99%CE%B1%CE%BD%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx</a></td>
</tr>

<tr>
<td class="left">/distribution/bfe4f55f152f7e5e457e0c61a32369e8</td>
<td class="left"><a href="https://datagovgreece.s3.amazonaws.com/resources/dataset_6/02%20%CE%A6%CE%B5%CE%B2%CF%81%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx">https://datagovgreece.s3.amazonaws.com/resources/dataset_6/02%20%CE%A6%CE%B5%CE%B2%CF%81%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx</a></td>
</tr>
</tbody>
</table>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_accessURL_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:accessURL ?accessUrl .
} WHERE {
    ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
    ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
    ?ds dcat:distribution ?dist.    
    ?dist a dcat:Distribution .
    ?dist dcat:accessURL ?accessUrl .
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>

<div id="outline-container-sec-2-4-1" class="outline-4">
<h4 id="sec-2-4-1"><span class="section-number-4">2.4.1</span> <span class="todo TODO">TODO</span> Check construction of ?distribution uri is okay.</h4>
</div>
</div>
<div id="outline-container-sec-2-5" class="outline-3">
<h3 id="sec-2-5"><span class="section-number-3">2.5</span> distribution license</h3>
<div class="outline-text-3" id="text-2-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_license">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gov.gr/predicate/&gt; 
SELECT DISTINCT ?distribution ?license
WHERE { GRAPH &lt;http://data.gov.gr/&gt; {
 ?ds a dcat:Dataset .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution . 
 ?dist dct:license ?license . 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">distribution</td>
<td class="left">license</td>
</tr>

<tr>
<td class="left">true/distributions/0793cde5cf7c69f8a20bcc54c1375393</td>
<td class="left"><a href="http://creativecommons.org/licenses/by-sa/3.0/">http://creativecommons.org/licenses/by-sa/3.0/</a></td>
</tr>

<tr>
<td class="left">true/distributions/bfe4f55f152f7e5e457e0c61a32369e8</td>
<td class="left"><a href="http://creativecommons.org/licenses/by-sa/3.0/">http://creativecommons.org/licenses/by-sa/3.0/</a></td>
</tr>
</tbody>
</table>

<p>
The INSERT for the license is:
</p>

<div class="org-src-container">

<pre class="src src-:tangle" id="sparqlend_format">PREFIX orig: &lt;http://data.gov.gr/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?distribution.
 ?distribution a dcat:Distribution.
 ?distribution dct:license ?license.
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds a dcat:Dataset .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution . 
 ?dist dct:license ?license . 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Optional</h2>
<div class="outline-text-2" id="text-3">
</div><div id="outline-container-sec-3-1" class="outline-3">
<h3 id="sec-3-1"><span class="section-number-3">3.1</span> byte size</h3>
<div class="outline-text-3" id="text-3-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_bytesize">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT DISTINCT ?distribution ?byteSize
WHERE { GRAPH &lt;http://data.gov.gr/&gt; {
 ?ds a dcat:Distribution .
 ?ds dcat:byteSize ?byteSize .
 FILTER( datatype(?byteSize) = xsd:decimal )
 BIND(iri(concat("/distribution/", md5(?ds))) AS ?distribution)
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">distribution</td>
<td class="left">byteSize</td>
</tr>
</tbody>
</table>
</div>

<div id="outline-container-sec-3-1-1" class="outline-4">
<h4 id="sec-3-1-1"><span class="section-number-4">3.1.1</span> <span class="todo TODO">TODO</span> byteSize is xsd:integer but spec says xsd:decimal</h4>
<div class="outline-text-4" id="text-3-1-1">
<dl class="org-dl">
<dt> Note </dt><dd>The filter is <b>not</b> included in the lodms query at
present - there would not be any results.
</dd>
</dl>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_byteSize_insert">PREFIX  dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX  dct:  &lt;http://purl.org/dc/terms/&gt;
INSERT  {
  ?harmds dcat:distribution ?distibution .
  ?distribution a dcat:Distribution .
  ?distribution dcat:byteSize ?byteSize .
} WHERE {
    ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds .
    ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
    ?ds dcat:distribution ?dist .
    ?dist a dcat:Distribution .
    ?dist dcat:byteSize ?byteSize .
    FILTER( datatype(?byteSize) = xsd:decimal )
    BIND(concat(str(?harmds), "/distributions/") AS ?hds)
    BIND(iri(concat(?hds, md5(?dist))) AS ?distribution)
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-3-2" class="outline-3">
<h3 id="sec-3-2"><span class="section-number-3">3.2</span> download URL</h3>
<div class="outline-text-3" id="text-3-2">
<p>
url points to a PDF
</p>
</div>
</div>
<div id="outline-container-sec-3-3" class="outline-3">
<h3 id="sec-3-3"><span class="section-number-3">3.3</span> media type</h3>
<div class="outline-text-3" id="text-3-3">
<p>
type indicates "dataset"
</p>
</div>
</div>
