odip.opendatasupport.eu/value_mapping/gr.org
** release date

#+NAME: sparqlend_select_rdate
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT ?dist ?issued
WHERE {
 ?ds a dcat:Distribution . 
 ?ds dct:issued ?issued .
 FILTER ( datatype(?issued) = xsd:date )
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist) } LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_rdate
| dist | issued |

The INSERT for the issued date.

#+NAME: sparqlend_rdate
#+begin_src rq :table yes
PREFIX orig: <http://data.gov.gr/catalog/predicate/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
prefix dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dcat:distribution ?distribution.
 ?distribution a dcat:Distribution.
 ?distribution dct:issued ?created.
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds a dcat:Dataset .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution .
 ?dist dcat:created ?created. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution).
}
#+end_src

** modification date

#+NAME: sparqlend_select_mdate
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT ?dist ?modified
WHERE {
 ?ds a dcat:Distribution . 
 ?ds dct:modified ?modified .
 FILTER ( datatype(?modified) = xsd:date )
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist) } LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_mdate

The INSERT is:

#+NAME: sparqlend_mdate
#+begin_src rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gov.gr/catalog/predicate/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
INSERT
{
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:modified ?modified.
}
WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution .
 ?dist dct:modified ?modified .
 FILTER ( datatype(?modified) = xsd:date )
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?dist).
}
#+end_src

** rights

** status

** title

#+NAME: sparqlend_title
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
SELECT DISTINCT ?ds ?title
WHERE { GRAPH <http://data.gov.gr/> { 
 ?ds a dcat:Distribution .
 ?ds dct:title ?title .
 FILTER( isLiteral(?title) )
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_title
| ds                                                                                                                                             | title                                |
| https://datagovgreece.s3.amazonaws.com/resources/dataset_6/01%20%CE%99%CE%B1%CE%BD%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx       | ????????? ??????? - ?????????? 2013  |
| https://datagovgreece.s3.amazonaws.com/resources/dataset_6/02%20%CE%A6%CE%B5%CE%B2%CF%81%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx | ????????? ??????? - ??????????? 2013 |

The associated INSERT for the title is:

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
INSERT {
 ?harmds dct:title ?title.
} WHERE { 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds.
 ?ds a dcat:Dataset .
 ?ds dct:title ?title . 
}
#+END_SRC

* Dataset properties
** Mandatory
*** Mapping description

#+NAME: sparqlend_description_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX orig: <http://data.gov.gr/catalog/predicate/> 
SELECT DISTINCT ?ds ?description
WHERE { GRAPH <http://data.gov.gr/> { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds dct:description ?description. 
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_description_select
| ds                            | description                                                        |
| http://data.gov.gr/dataset/6/ | ????? ?????????? ??????? ??? ?? ????????????? ????? ????? ???????? |
| http://data.gov.gr/dataset/6/ | Prices of diesel from the Fuels Price Observatory                  |

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:description ?description
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds a dcat:Dataset .
 ?ds dct:description ?description. 
}
#+END_SRC

*** Mapping Title

The INSERT statement is:
#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?ds a dcat:Dataset .
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds dct:title ?title .
}
#+END_SRC 

** Recommended
*** Map tags to keywords

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
  ?harmds dcat:keyword ?keyword
} WHERE {
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?ds a dcat:Dataset . 
  ?ds dcat:keyword ?keyword .
}
#+END_SRC

