odip.opendatasupport.eu/mapping_queries/gr.html
<div id="outline-container-sec-3-4" class="outline-3">
<h3 id="sec-3-4"><span class="section-number-3">3.4</span> release date</h3>
<div class="outline-text-3" id="text-3-4">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_rdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT ?dist ?issued
WHERE {
 ?ds a dcat:Distribution . 
 ?ds dct:issued ?issued .
 FILTER ( datatype(?issued) = xsd:date )
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist) } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">dist</td>
<td class="left">issued</td>
</tr>
</tbody>
</table>

<p>
The INSERT for the issued date.
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_rdate">PREFIX orig: &lt;http://data.gov.gr/catalog/predicate/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
prefix dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dcat:distribution ?distribution.
 ?distribution a dcat:Distribution.
 ?distribution dct:issued ?created.
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds a dcat:Dataset .
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution .
 ?dist dcat:created ?created. 
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?distribution).
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-5" class="outline-3">
<h3 id="sec-3-5"><span class="section-number-3">3.5</span> modification date</h3>
<div class="outline-text-3" id="text-3-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_mdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT ?dist ?modified
WHERE {
 ?ds a dcat:Distribution . 
 ?ds dct:modified ?modified .
 FILTER ( datatype(?modified) = xsd:date )
 BIND(CONCAT(STR("harmds"),"/distributions/") AS ?hds)
 BIND(IRI(CONCAT(?hds,md5(?ds))) AS ?dist) } LIMIT 10
</pre>
</div>

<p>
The INSERT is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_mdate">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gov.gr/catalog/predicate/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
INSERT
{
 ?harmds dcat:distribution ?dist.
 ?dist a dcat:Distribution.
 ?dist dct:modified ?modified.
}
WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds dcat:distribution ?dist .
 ?dist a dcat:Distribution .
 ?dist dct:modified ?modified .
 FILTER ( datatype(?modified) = xsd:date )
 BIND(CONCAT(STR(?harmds),"/distributions/") AS ?hds).
 BIND(IRI(CONCAT(?hds,md5(?dist))) AS ?dist).
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-3-6" class="outline-3">
<h3 id="sec-3-6"><span class="section-number-3">3.6</span> rights</h3>
</div>

<div id="outline-container-sec-3-7" class="outline-3">
<h3 id="sec-3-7"><span class="section-number-3">3.7</span> status</h3>
</div>

<div id="outline-container-sec-3-8" class="outline-3">
<h3 id="sec-3-8"><span class="section-number-3">3.8</span> title</h3>
<div class="outline-text-3" id="text-3-8">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_title">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?ds ?title
WHERE { GRAPH &lt;http://data.gov.gr/&gt; { 
 ?ds a dcat:Distribution .
 ?ds dct:title ?title .
 FILTER( isLiteral(?title) )
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">title</td>
</tr>

<tr>
<td class="left"><a href="https://datagovgreece.s3.amazonaws.com/resources/dataset_6/01%20%CE%99%CE%B1%CE%BD%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx">https://datagovgreece.s3.amazonaws.com/resources/dataset_6/01%20%CE%99%CE%B1%CE%BD%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx</a></td>
<td class="left">????????? ??????? - ?????????? 2013</td>
</tr>

<tr>
<td class="left"><a href="https://datagovgreece.s3.amazonaws.com/resources/dataset_6/02%20%CE%A6%CE%B5%CE%B2%CF%81%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx">https://datagovgreece.s3.amazonaws.com/resources/dataset_6/02%20%CE%A6%CE%B5%CE%B2%CF%81%CE%BF%CF%85%CE%AC%CF%81%CE%B9%CE%BF%CF%82%202013.xlsx</a></td>
<td class="left">????????? ??????? - ??????????? 2013</td>
</tr>
</tbody>
</table>

<p>
The associated INSERT for the title is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
INSERT {
 ?harmds dct:title ?title.
} WHERE { 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds.
 ?ds a dcat:Dataset .
 ?ds dct:title ?title . 
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Dataset properties</h2>
<div class="outline-text-2" id="text-4">
</div><div id="outline-container-sec-4-1" class="outline-3">
<h3 id="sec-4-1"><span class="section-number-3">4.1</span> Mandatory</h3>
<div class="outline-text-3" id="text-4-1">
</div><div id="outline-container-sec-4-1-1" class="outline-4">
<h4 id="sec-4-1-1"><span class="section-number-4">4.1.1</span> Mapping description</h4>
<div class="outline-text-4" id="text-4-1-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_description_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX orig: &lt;http://data.gov.gr/catalog/predicate/&gt; 
SELECT DISTINCT ?ds ?description
WHERE { GRAPH &lt;http://data.gov.gr/&gt; { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds dct:description ?description. 
} } LIMIT 10
</pre>
</div>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:description ?description
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds a dcat:Dataset .
 ?ds dct:description ?description. 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-1-2" class="outline-4">
<h4 id="sec-4-1-2"><span class="section-number-4">4.1.2</span> Mapping Title</h4>
<div class="outline-text-4" id="text-4-1-2">
<p>
The INSERT statement is:
</p>
<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:title ?title
} WHERE {
 ?ds a dcat:Dataset .
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds dct:title ?title .
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-2" class="outline-3">
<h3 id="sec-4-2"><span class="section-number-3">4.2</span> Recommended</h3>
<div class="outline-text-3" id="text-4-2">
</div><div id="outline-container-sec-4-2-1" class="outline-4">
<h4 id="sec-4-2-1"><span class="section-number-4">4.2.1</span> Map tags to keywords</h4>
<div class="outline-text-4" id="text-4-2-1">
<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
  ?harmds dcat:keyword ?keyword
} WHERE {
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?ds a dcat:Dataset . 
  ?ds dcat:keyword ?keyword .
}
</pre>
</div>
</div>
</div>
