odip.opendatasupport.eu/value_mapping/gr.org
*** Mapping theme

#+NAME: sparqlend_theme_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#> 
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?theme
FROM <http://data.gov.gr/>
WHERE {
 ?ds a dcat:Dataset .
 ?ds dcat:theme ?theme .
} LIMIT 50
#+end_src

#+NAME: sparqlend_theme_select
| theme |
| EC    |
| PR    |

The INSERT Statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dcat:theme ?theme .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds a dcat:Dataset .
  ?ds dcat:theme ?theme . 
}
#+END_SRC

*** TODO Mapping contactPoint email

Not found 

#+NAME: sparqlend_email_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql
PREFIX  dct: <http://purl.org/dc/terms/> 
PREFIX  adms: <http://www.w3.org/ns/adms#>
SELECT DISTINCT ?ds ?contactPoint
FROM <http://data.gov.gr/>
WHERE { 
 ?ds adms:contactPoint ?contactPoint .  
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_email_select
| ds                            | contactPoint            |
| http://data.gov.gr/dataset/6/ | mailto:info@data.gov.gr |

The INSERT statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX  orig: <http://www.gov.gr/catalog/predicate/> 
PREFIX  adms: <http://www.w3.org/ns/adms#>
INSERT { 
  ?harmds adms:contactPoint ?cPoint .
  ?cPoint a <http://www.w3.org/2006/vcard/ns#VCard> .
  ?cPoint <http://www.w3.org/2006/vcard/ns#email>  ?emailTo
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
  ?ds a <http://www.w3.org/ns/dcat#Dataset> . 
  ?ds adms:contactPoint ?emailTo .
  BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint) 
}
#+END_SRC

*** TODO Mapping contactPoint name

Not found 

*** Mapping publisher

#+NAME: sparqlend_publisher_select
#+BEGIN_SRC roqet :endpoint http://192.168.33.33/sparql
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
SELECT DISTINCT ?publisher
FROM <http://data.gov.gr/>
WHERE {
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_publisher_select
| publisher             |
| http://www.ypoian.gr/ |

The INSERT statement is:

#+NAME: sparqlend_publisher_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct:<http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:publisher ?publisher
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
}
#+END_SRC

** Optional

*** dataset conformsTo (dct:conformsTo)
    
#+NAME: sparqlend_conformsTo_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?ds ?conformsTo
FROM <http://data.gov.gr/>
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:conformsTo ?conformsTo .
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_conformsTo_select
| ds | conformsTo |

The INSERT statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:conformsTo ?conforms .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:conformsTo ?conformsTo . 
}
#+END_SRC

*** TODO dataset frequency (dct:accrualPeriodicity)

Is present, but needs mapping

*** TODO dataset identifier (dct:identifier)

#+NAME: sparqlend_select_name
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?identifier
WHERE { GRAPH <http://data.gov.gr/> { 
  ?ds a <http://www.w3.org/ns/dcat#Dataset> .
  ?ds dct:identifier ?identifier .
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_select_name
| identifier                    |
| http://data.gov.gr/dataset/6/ |

The identifier INSERT statement:

#+NAME: sparqlend_name_insert
#+BEGIN_SRC rq :tangle yes
PREFIX adms: <http://www.w3.org/ns/adms#> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
 ?harmds adms:identifier ?identifier .
} WHERE { 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds.  
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
 ?ds a dcat:Dataset .
 ?ds  dct:identifier ?identifier xs
}
#+END_SRC

*** TODO dataset landing page (dcat:landingPage)

Nothing found at present.

*** dataset language (dct:language)

#+NAME: sparqlend_language_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
SELECT DISTINCT ?ds ?language
FROM <http://data.gov.gr/>
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:language ?language .
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_language_select
| ds                            | language                                 |
| http://data.gov.gr/dataset/6/ | http://id.loc.gov/vocabulary/iso639-1/el |
| http://data.gov.gr/dataset/6/ | http://id.loc.gov/vocabulary/iso639-1/en |

The INSERT statement is:

#+NAME: sparqlend_email_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT { 
  ?harmds dct:language ?language .
} WHERE { 
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:language ?language . 
}
#+END_SRC

**** TODO Language Value needs to be mapped (iso vocab)
     
*** dataset other identifier (adms:identifier)

Identifier is present.

