odip.opendatasupport.eu/mapping_queries/gr.html
<div id="outline-container-sec-4-2-2" class="outline-4">
<h4 id="sec-4-2-2"><span class="section-number-4">4.2.2</span> Mapping theme</h4>
<div class="outline-text-4" id="text-4-2-2">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_theme_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt; 
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?theme
FROM &lt;http://data.gov.gr/&gt;
WHERE {
 ?ds a dcat:Dataset .
 ?ds dcat:theme ?theme .
} LIMIT 50
</pre>
</div>

<table id="sparqlend_theme_select" border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">theme</td>
</tr>

<tr>
<td class="left">EC</td>
</tr>

<tr>
<td class="left">PR</td>
</tr>
</tbody>
</table>

<p>
The INSERT Statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dcat:theme ?theme .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds a dcat:Dataset .
  ?ds dcat:theme ?theme . 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2-3" class="outline-4">
<h4 id="sec-4-2-3"><span class="section-number-4">4.2.3</span> <span class="todo TODO">TODO</span> Mapping contactPoint email</h4>
<div class="outline-text-4" id="text-4-2-3">
<p>
Not found 
</p>

<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_email_select">PREFIX  dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX  adms: &lt;http://www.w3.org/ns/adms#&gt;
SELECT DISTINCT ?ds ?contactPoint
FROM &lt;http://data.gov.gr/&gt;
WHERE { 
 ?ds adms:contactPoint ?contactPoint .  
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX  orig: &lt;http://www.gov.gr/catalog/predicate/&gt; 
PREFIX  adms: &lt;http://www.w3.org/ns/adms#&gt;
INSERT { 
  ?harmds adms:contactPoint ?cPoint .
  ?cPoint a &lt;http://www.w3.org/2006/vcard/ns#VCard&gt; .
  ?cPoint &lt;http://www.w3.org/2006/vcard/ns#email&gt;  ?emailTo
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; . 
  ?ds adms:contactPoint ?emailTo .
  BIND (IRI(CONCAT(?ds,"/contactPoint")) AS ?cPoint) 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-2-4" class="outline-4">
<h4 id="sec-4-2-4"><span class="section-number-4">4.2.4</span> <span class="todo TODO">TODO</span> Mapping contactPoint name</h4>
<div class="outline-text-4" id="text-4-2-4">
<p>
Not found 
</p>
</div>
</div>
<div id="outline-container-sec-4-2-5" class="outline-4">
<h4 id="sec-4-2-5"><span class="section-number-4">4.2.5</span> Mapping publisher</h4>
<div class="outline-text-4" id="text-4-2-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_publisher_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?publisher
FROM &lt;http://data.gov.gr/&gt;
WHERE {
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
} LIMIT 10
</pre>
</div>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_publisher_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:publisher ?publisher
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?ds a dcat:Dataset .
  ?ds dct:publisher ?publisher .
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-sec-4-3" class="outline-3">
<h3 id="sec-4-3"><span class="section-number-3">4.3</span> Optional</h3>
<div class="outline-text-3" id="text-4-3">
</div><div id="outline-container-sec-4-3-1" class="outline-4">
<h4 id="sec-4-3-1"><span class="section-number-4">4.3.1</span> dataset conformsTo (dct:conformsTo)</h4>
<div class="outline-text-4" id="text-4-3-1">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_conformsTo_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?ds ?conformsTo
FROM &lt;http://data.gov.gr/&gt;
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:conformsTo ?conformsTo .
} LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">conformsTo</td>
</tr>
</tbody>
</table>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:conformsTo ?conforms .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:conformsTo ?conformsTo . 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-2" class="outline-4">
<h4 id="sec-4-3-2"><span class="section-number-4">4.3.2</span> <span class="todo TODO">TODO</span> dataset frequency (dct:accrualPeriodicity)</h4>
<div class="outline-text-4" id="text-4-3-2">
<p>
Is present, but needs mapping
</p>
</div>
</div>
<div id="outline-container-sec-4-3-3" class="outline-4">
<h4 id="sec-4-3-3"><span class="section-number-4">4.3.3</span> <span class="todo TODO">TODO</span> dataset identifier (dct:identifier)</h4>
<div class="outline-text-4" id="text-4-3-3">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_select_name">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?identifier
WHERE { GRAPH &lt;http://data.gov.gr/&gt; { 
  ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt; .
  ?ds dct:identifier ?identifier .
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">identifier</td>
</tr>

<tr>
<td class="left"><a href="http://data.gov.gr/dataset/6/">http://data.gov.gr/dataset/6/</a></td>
</tr>
</tbody>
</table>

<p>
The identifier INSERT statement:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_name_insert">PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
 ?harmds adms:identifier ?identifier .
} WHERE { 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds.  
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
 ?ds a dcat:Dataset .
 ?ds  dct:identifier ?identifier xs
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-4" class="outline-4">
<h4 id="sec-4-3-4"><span class="section-number-4">4.3.4</span> <span class="todo TODO">TODO</span> dataset landing page (dcat:landingPage)</h4>
<div class="outline-text-4" id="text-4-3-4">
<p>
Nothing found at present.
</p>
</div>
</div>
<div id="outline-container-sec-4-3-5" class="outline-4">
<h4 id="sec-4-3-5"><span class="section-number-4">4.3.5</span> dataset language (dct:language)</h4>
<div class="outline-text-4" id="text-4-3-5">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_language_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
SELECT DISTINCT ?ds ?language
FROM &lt;http://data.gov.gr/&gt;
WHERE { 
 ?ds a dcat:Dataset .
 ?ds dct:language ?language .
} LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">language</td>
</tr>

<tr>
<td class="left"><a href="http://data.gov.gr/dataset/6/">http://data.gov.gr/dataset/6/</a></td>
<td class="left"><a href="http://id.loc.gov/vocabulary/iso639-1/el">http://id.loc.gov/vocabulary/iso639-1/el</a></td>
</tr>

<tr>
<td class="left"><a href="http://data.gov.gr/dataset/6/">http://data.gov.gr/dataset/6/</a></td>
<td class="left"><a href="http://id.loc.gov/vocabulary/iso639-1/en">http://id.loc.gov/vocabulary/iso639-1/en</a></td>
</tr>
</tbody>
</table>

<p>
The INSERT statement is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_email_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT { 
  ?harmds dct:language ?language .
} WHERE { 
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds .
  ?ds a dcat:Dataset .
  ?ds dct:language ?language . 
}
</pre>
</div>
</div>

<ol class="org-ol"><li><span class="todo TODO">TODO</span> Language Value needs to be mapped (iso vocab)<br  /></li></ol>
</div>
<div id="outline-container-sec-4-3-6" class="outline-4">
<h4 id="sec-4-3-6"><span class="section-number-4">4.3.6</span> dataset other identifier (adms:identifier)</h4>
<div class="outline-text-4" id="text-4-3-6">
<p>
Identifier is present.
</p>
</div>
</div>
