odip.opendatasupport.eu/value_mapping/gr.org
*** dataset release date (dct:issued)

#+NAME: sparqlend_dsissued_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT ?ds ?issued
WHERE { GRAPH <http://data.gov.gr/> {
 ?ds a dcat:Dataset . 
 ?ds dct:issued ?issued . 
 FILTER( datatype(?issued) = xsd:date )
} }  LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_dsissued_select
| ds | issued |

#+NAME: sparqlend_issued_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
INSERT {
  ?harmds dct:issued ?issued
} WHERE {
  ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
  ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
  ?ds a dcat:Dataset . 
  ?ds dct:issued ?issued .
  FILTER( datatype(?issued) = xsd:date )
}
#+END_SRC

*** dataset modification date (dct:modified)

#+NAME: sparqlend_dsmodified_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
SELECT ?ds ?modified
WHERE { GRAPH <http://data.gov.gr/> {
 ?ds a dcat:Dataset .
 ?ds dct:modified ?modified .
  FILTER( isLiteral(?modified) )
} } LIMIT 10
#+end_src

**** TODO dsModified should be date or dateTime - it fails it the filter restricts further
     ie. FILTER( datatype(?modified) = xsd:date )

#+RESULTS: sparqlend_dsmodified_select
| ds                            |   modified |
| http://data.gov.gr/dataset/6/ | 2013-10-09 |

#+NAME: sparqlend_title_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dct:<http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX xsd: <http://www.w3.org/2001/XMLSchema#>
INSERT {
 ?harmds dct:modified ?modified
} WHERE {
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?ds a dcat:Dataset . 
 ?ds dcat:modified ?modified . 
}
#+END_SRC

*** TODO dataset spatial/geographic (dct:spatial)

#+NAME: sparqlend_spatial_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?ds ?spatial
WHERE { GRAPH <http://data.gov.gr/> {
 ?ds a dcat:Dataset .
 ?ds dct:spatial ?spatial .
} } LIMIT 10
#+end_src

#+RESULTS: sparqlend_spatial_select
| ds                            | spatial                                                      |
| http://data.gov.gr/dataset/6/ | http://publications.europa.eu/resource/authority/country/GRC |

The INSERT for the spatial is:

#+NAME: sparqlend_spatial_insert
#+BEGIN_SRC rq :tangle yes
PREFIX dcat: <http://www.w3.org/ns/dcat#>
PREFIX dct: <http://purl.org/dc/terms/> 
INSERT {
 ?harmds dct:spatial ?modified
} WHERE {
 ?ds a dcat:Dataset . 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds . 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds . 
 ?ds dct:spatial ?modified . 
}
#+END_SRC

*** TODO dataset temporal (dct:temporal)

Info not found


*** dataset version

#+NAME: sparqlend_version_select
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
PREFIX dct: <http://purl.org/dc/terms/> 
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?version
WHERE { 
 ?ds a dcat:Dataset . 
 ?ds dcat:version ?version . 
} LIMIT 10
#+END_SRC

#+RESULTS: sparqlend_version_select
: version

#+NAME: sparqlend_version_insert
#+BEGIN_SRC rq :tangle yes
PREFIX orig: <http://data.gov.gr/catalog/predicate/> 
PREFIX adms: <http://www.w3.org/ns/adms#> 
INSERT { 
 ?harmds adms:version ?d .
} WHERE { 
 ?ds a <http://www.w3.org/ns/dcat#Dataset>. 
 ?ds  orig:version  ?d. 
 ?harmrecord <http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset> ?ds. 
 ?harmrecord <http://xmlns.com/foaf/0.1/primaryTopic> ?harmds. 
}
#+END_SRC

*** TODO dataset version notes (adms:versionNotes)

Not found 

*** dataset status

Not found

