odip.opendatasupport.eu/mapping_queries/gr.html
<div id="outline-container-sec-4-3-7" class="outline-4">
<h4 id="sec-4-3-7"><span class="section-number-4">4.3.7</span> dataset release date (dct:issued)</h4>
<div class="outline-text-4" id="text-4-3-7">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_dsissued_select">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT ?ds ?issued
WHERE { GRAPH &lt;http://data.gov.gr/&gt; {
 ?ds a dcat:Dataset . 
 ?ds dct:issued ?issued . 
 FILTER( datatype(?issued) = xsd:date )
} }  LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">issued</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_issued_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
INSERT {
  ?harmds dct:issued ?issued
} WHERE {
  ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
  ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
  ?ds a dcat:Dataset . 
  ?ds dct:issued ?issued .
  FILTER( datatype(?issued) = xsd:date )
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-8" class="outline-4">
<h4 id="sec-4-3-8"><span class="section-number-4">4.3.8</span> dataset modification date (dct:modified)</h4>
<div class="outline-text-4" id="text-4-3-8">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_dsmodified_select">PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
SELECT ?ds ?modified
WHERE { GRAPH &lt;http://data.gov.gr/&gt; {
 ?ds a dcat:Dataset .
 ?ds dct:modified ?modified .
  FILTER( isLiteral(?modified) )
} } LIMIT 10
</pre>
</div>
</div>

<ol class="org-ol"><li><span class="todo TODO">TODO</span> dsModified should be date or dateTime - it fails it the filter restricts further<br  /><div class="outline-text-5" id="text-4-3-8-1">
<p>
ie. FILTER( datatype(?modified) = xsd:date )
</p>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="right" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="right">modified</td>
</tr>

<tr>
<td class="left"><a href="http://data.gov.gr/dataset/6/">http://data.gov.gr/dataset/6/</a></td>
<td class="right">2013-10-09</td>
</tr>
</tbody>
</table>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_title_insert">PREFIX dct:&lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX xsd: &lt;http://www.w3.org/2001/XMLSchema#&gt;
INSERT {
 ?harmds dct:modified ?modified
} WHERE {
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?ds a dcat:Dataset . 
 ?ds dcat:modified ?modified . 
}
</pre>
</div>
</div>
</li></ol>
</div>
<div id="outline-container-sec-4-3-9" class="outline-4">
<h4 id="sec-4-3-9"><span class="section-number-4">4.3.9</span> <span class="todo TODO">TODO</span> dataset spatial/geographic (dct:spatial)</h4>
<div class="outline-text-4" id="text-4-3-9">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_spatial_select">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
SELECT ?ds ?spatial
WHERE { GRAPH &lt;http://data.gov.gr/&gt; {
 ?ds a dcat:Dataset .
 ?ds dct:spatial ?spatial .
} } LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">ds</td>
<td class="left">spatial</td>
</tr>

<tr>
<td class="left"><a href="http://data.gov.gr/dataset/6/">http://data.gov.gr/dataset/6/</a></td>
<td class="left"><a href="http://publications.europa.eu/resource/authority/country/GRC">http://publications.europa.eu/resource/authority/country/GRC</a></td>
</tr>
</tbody>
</table>

<p>
The INSERT for the spatial is:
</p>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_spatial_insert">PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
INSERT {
 ?harmds dct:spatial ?modified
} WHERE {
 ?ds a dcat:Dataset . 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds . 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds . 
 ?ds dct:spatial ?modified . 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-10" class="outline-4">
<h4 id="sec-4-3-10"><span class="section-number-4">4.3.10</span> <span class="todo TODO">TODO</span> dataset temporal (dct:temporal)</h4>
<div class="outline-text-4" id="text-4-3-10">
<p>
Info not found
</p>
</div>
</div>

<div id="outline-container-sec-4-3-11" class="outline-4">
<h4 id="sec-4-3-11"><span class="section-number-4">4.3.11</span> dataset version</h4>
<div class="outline-text-4" id="text-4-3-11">
<div class="org-src-container">

<pre class="src src-roqet" id="sparqlend_version_select">PREFIX dct: &lt;http://purl.org/dc/terms/&gt; 
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
SELECT ?version
WHERE { 
 ?ds a dcat:Dataset . 
 ?ds dcat:version ?version . 
} LIMIT 10
</pre>
</div>

<pre class="example">
version
</pre>

<div class="org-src-container">

<pre class="src src-rq" id="sparqlend_version_insert">PREFIX orig: &lt;http://data.gov.gr/catalog/predicate/&gt; 
PREFIX adms: &lt;http://www.w3.org/ns/adms#&gt; 
INSERT { 
 ?harmds adms:version ?d .
} WHERE { 
 ?ds a &lt;http://www.w3.org/ns/dcat#Dataset&gt;. 
 ?ds  orig:version  ?d. 
 ?harmrecord &lt;http://data.opendatasupport.eu/ontology/harmonisation.owl#raw_dataset&gt; ?ds. 
 ?harmrecord &lt;http://xmlns.com/foaf/0.1/primaryTopic&gt; ?harmds. 
}
</pre>
</div>
</div>
</div>
<div id="outline-container-sec-4-3-12" class="outline-4">
<h4 id="sec-4-3-12"><span class="section-number-4">4.3.12</span> <span class="todo TODO">TODO</span> dataset version notes (adms:versionNotes)</h4>
<div class="outline-text-4" id="text-4-3-12">
<p>
Not found 
</p>
</div>
</div>
