odip.opendatasupport.eu/value_mapping/gr.org
* Value Mapping

http://publications.europa.eu/resource/authority/file-type

#+NAME: sparqlend_select_concept
#+begin_src roqet :endpoint http://192.168.33.33/sparql :exports both
select distinct ?concept
FROM <http://publications.europa.eu/resource/authority/file-type>
WHERE {
  ?concept a <http://www.w3.org/2004/02/skos/core#Concept>
} ORDER BY ?concept
#+end_src

| concept                                                               | current |
|-----------------------------------------------------------------------+---------|
| http://publications.europa.eu/resource/authority/file-type/AZW        |         |
| http://publications.europa.eu/resource/authority/file-type/CSV        | yes     |
| http://publications.europa.eu/resource/authority/file-type/DBF        |         |
| http://publications.europa.eu/resource/authority/file-type/DOC        | yes     |
| http://publications.europa.eu/resource/authority/file-type/DOCX       |         |
| http://publications.europa.eu/resource/authority/file-type/E00        |         |
| http://publications.europa.eu/resource/authority/file-type/EPUB       |         |
| http://publications.europa.eu/resource/authority/file-type/FMX2       |         |
| http://publications.europa.eu/resource/authority/file-type/FMX3       |         |
| http://publications.europa.eu/resource/authority/file-type/FMX4       |         |
| http://publications.europa.eu/resource/authority/file-type/GIF        |         |
| http://publications.europa.eu/resource/authority/file-type/GZIP       |         |
| http://publications.europa.eu/resource/authority/file-type/HTML       | yes     |
| http://publications.europa.eu/resource/authority/file-type/JPEG       |         |
| http://publications.europa.eu/resource/authority/file-type/JSON       |         |
| http://publications.europa.eu/resource/authority/file-type/KML        |         |
| http://publications.europa.eu/resource/authority/file-type/MDB        |         |
| http://publications.europa.eu/resource/authority/file-type/MOBI       |         |
| http://publications.europa.eu/resource/authority/file-type/MOP        |         |
| http://publications.europa.eu/resource/authority/file-type/MXD        |         |
| http://publications.europa.eu/resource/authority/file-type/OP_DATPRO  |         |
| http://publications.europa.eu/resource/authority/file-type/PDF        | yes     |
| http://publications.europa.eu/resource/authority/file-type/PDFA1A     |         |
| http://publications.europa.eu/resource/authority/file-type/PDFA1B     |         |
| http://publications.europa.eu/resource/authority/file-type/PDFX       |         |
| http://publications.europa.eu/resource/authority/file-type/PNG        |         |
| http://publications.europa.eu/resource/authority/file-type/PPSX       |         |
| http://publications.europa.eu/resource/authority/file-type/PPT        |         |
| http://publications.europa.eu/resource/authority/file-type/PPTX       |         |
| http://publications.europa.eu/resource/authority/file-type/RDF_XML    |         |
| http://publications.europa.eu/resource/authority/file-type/RTF        | yes     |
| http://publications.europa.eu/resource/authority/file-type/SGML       |         |
| http://publications.europa.eu/resource/authority/file-type/SKOS_XML   |         |
| http://publications.europa.eu/resource/authority/file-type/SPARQLQ    |         |
| http://publications.europa.eu/resource/authority/file-type/SPARQLQRES |         |
| http://publications.europa.eu/resource/authority/file-type/TIFF       |         |
| http://publications.europa.eu/resource/authority/file-type/TSV        |         |
| http://publications.europa.eu/resource/authority/file-type/TXT        |         |
| http://publications.europa.eu/resource/authority/file-type/XHTML      |         |
| http://publications.europa.eu/resource/authority/file-type/XLS        |         |
| http://publications.europa.eu/resource/authority/file-type/XLSX       |         |
| http://publications.europa.eu/resource/authority/file-type/XML        | yes     |
| http://publications.europa.eu/resource/authority/file-type/XSLT       |         |
| http://publications.europa.eu/resource/authority/file-type/ZIP        | yes     |

*** TODO Mapping of the format, finish the rest - possible to just copy 
    across and instantiate it?

* ODS Greece Harmonization Tasks
** LodManager Initialisation [2/3]
*** DONE Virtuoso Extractors
    - State "DONE"       from "TODO"       [2013-12-18 Wed 14:07]
