odip.opendatasupport.eu/value_mapping/gr.org
*** TODO Transformers [4/4]
**** DONE ODS Dcat application profile harmonizer
     - State "DONE"       from "TODO"       [2013-12-18 Wed 14:44]
**** DONE ODS Modification Detector
     - State "DONE"       from "TODO"       [2013-12-18 Wed 14:44]
**** Sparql Update Tranformations [1/2]
***** TODO Initial versions
***** TODO Test Transformations
**** ODS Value Mapper [1/2]
***** DONE Plugin Added
      - State "DONE"       from "TODO"       [2013-12-18 Wed 14:44]
***** TODO Add Value Mappings
**** DONE ODS Cleaner
     - State "DONE"       from "TODO"       [2013-12-18 Wed 14:44]
**** DONE ODS Validator 
     - State "DONE"       from "TODO"       [2013-12-18 Wed 14:44]
*** DONE Virtuoso Loader
    - State "DONE"       from "TODO"       [2013-12-18 Wed 14:44]
** Tests

#+begin_src roqet :endpoint http://192.168.33.33/sparql  :exports both
PREFIX dcterms: <http://purl.org/dc/terms/>
PREFIX dcat: <http://www.w3.org/ns/dcat#>
SELECT ?s ?p ?o
WHERE {
  ?s a dcat:Distribution.
  OPTIONAL {?s dcterms:format ?format }
  FILTER (!BOUND(?format))
  BIND("p" AS ?p)
  BIND("o" AS ?o)
} LIMIT 10
#+end_src

#+RESULTS:
| s                                                                                                                                                      | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_annuario-statistico/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15 | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto/distributions/03df43db-153f-4b81-9089-dd7e20dba312        | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto/distributions/e9226892-4b01-4fb1-94ff-d09a800d15d1        | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/0ba702c8-5728-4584-892f-539c621970b7   | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/9766a807-e8db-4bdc-ab53-a95e74de0e51   | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/7fd5facd-a90b-4e5a-8885-28253a1d3ca8   | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/a16ed920-c2f3-46e2-98d5-ded3e4ad1741   | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/19a9c2b8-eaf7-4e7e-8237-da646df55080   | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/222d26cd-9cda-4d03-9371-aefef9a49e3a   | p | o |
| http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-2h-2013/distributions/d53869c8-304f-459f-a9f5-78bc77ed5f66   | p | o |

