odip.opendatasupport.eu/mapping_queries/gr.html

<div id="outline-container-sec-6-1-2" class="outline-4">
<h4 id="sec-6-1-2"><span class="section-number-4">6.1.2</span> <span class="todo TODO">TODO</span> Transformers <code>[4/4]</code></h4>
<div class="outline-text-4" id="text-6-1-2">
</div><ol class="org-ol"><li><span class="done DONE">DONE</span> ODS Dcat application profile harmonizer<br  /><div class="outline-text-5" id="text-6-1-2-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-18 Wed 14:44]</span></span>
</li>
</ul>
</div>
</li>

<li><span class="done DONE">DONE</span> ODS Modification Detector<br  /><div class="outline-text-5" id="text-6-1-2-2">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-18 Wed 14:44]</span></span>
</li>
</ul>
</div>
</li>

<li>Sparql Update Tranformations <code>[1/2]</code><br  /><ol class="org-ol"><li><span class="todo TODO">TODO</span> Initial versions<br  /></li>
<li><span class="todo TODO">TODO</span> Test Transformations<br  /></li></ol>
</li>

<li>ODS Value Mapper <code>[1/2]</code><br  /><ol class="org-ol"><li><span class="done DONE">DONE</span> Plugin Added<br  /><div class="outline-text-6" id="text-6-1-2-4-1">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-18 Wed 14:44]</span></span>
</li>
</ul>
</div>
</li>

<li><span class="todo TODO">TODO</span> Add Value Mappings<br  /></li></ol>
</li>

<li><span class="done DONE">DONE</span> ODS Cleaner<br  /><div class="outline-text-5" id="text-6-1-2-5">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-18 Wed 14:44]</span></span>
</li>
</ul>
</div>
</li>

<li><span class="done DONE">DONE</span> ODS Validator<br  /><div class="outline-text-5" id="text-6-1-2-6">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-18 Wed 14:44]</span></span>
</li>
</ul>
</div>
</li></ol>
</div>

<div id="outline-container-sec-6-1-3" class="outline-4">
<h4 id="sec-6-1-3"><span class="section-number-4">6.1.3</span> <span class="done DONE">DONE</span> Virtuoso Loader</h4>
<div class="outline-text-4" id="text-6-1-3">
<ul class="org-ul">
<li>State "DONE"       from "TODO"       <span class="timestamp-wrapper"><span class="timestamp">[2013-12-18 Wed 14:44]</span></span>
</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-sec-6-2" class="outline-3">
<h3 id="sec-6-2"><span class="section-number-3">6.2</span> Tests</h3>
<div class="outline-text-3" id="text-6-2">
<div class="org-src-container">

<pre class="src src-roqet">PREFIX dcterms: &lt;http://purl.org/dc/terms/&gt;
PREFIX dcat: &lt;http://www.w3.org/ns/dcat#&gt;
SELECT ?s ?p ?o
WHERE {
  ?s a dcat:Distribution.
  OPTIONAL {?s dcterms:format ?format }
  FILTER (!BOUND(?format))
  BIND("p" AS ?p)
  BIND("o" AS ?o)
} LIMIT 10
</pre>
</div>

<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="left" />

<col  class="left" />

<col  class="left" />
</colgroup>
<tbody>
<tr>
<td class="left">s</td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_annuario-statistico/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_annuario-statistico/distributions/c6eb80a9-54cb-44d2-8979-12996956ed15</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto/distributions/03df43db-153f-4b81-9089-dd7e20dba312">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto/distributions/03df43db-153f-4b81-9089-dd7e20dba312</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto/distributions/e9226892-4b01-4fb1-94ff-d09a800d15d1">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autoritratto/distributions/e9226892-4b01-4fb1-94ff-d09a800d15d1</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/0ba702c8-5728-4584-892f-539c621970b7">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/0ba702c8-5728-4584-892f-539c621970b7</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/9766a807-e8db-4bdc-ab53-a95e74de0e51">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/9766a807-e8db-4bdc-ab53-a95e74de0e51</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/7fd5facd-a90b-4e5a-8885-28253a1d3ca8">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/7fd5facd-a90b-4e5a-8885-28253a1d3ca8</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/a16ed920-c2f3-46e2-98d5-ded3e4ad1741">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/a16ed920-c2f3-46e2-98d5-ded3e4ad1741</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/19a9c2b8-eaf7-4e7e-8237-da646df55080">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/19a9c2b8-eaf7-4e7e-8237-da646df55080</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/222d26cd-9cda-4d03-9371-aefef9a49e3a">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-1h-2013/distributions/222d26cd-9cda-4d03-9371-aefef9a49e3a</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>

<tr>
<td class="left"><a href="http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-2h-2013/distributions/d53869c8-304f-459f-a9f5-78bc77ed5f66">http://data.opendatasupport.eu/id/catalog/it/dataset/aci-automobile-club-italia_autotrend-2h-2013/distributions/d53869c8-304f-459f-a9f5-78bc77ed5f66</a></td>
<td class="left">p</td>
<td class="left">o</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Paul Massey</p>
<p class="date">Created: 2013-12-19 Thu 16:25</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 24.3.50.1 (<a href="http://orgmode.org">Org</a> mode 8.2.3a)</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
